---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType.LappedCircle
enum: Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType
source: html/555907d2-578b-026a-347c-8900bcf538d8.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType.LappedCircle

A full circle, subtending an angle more
 than 360 degrees and less than 720 degrees. The
 behavior in Revit is the same as Arc, but an extra
 complete circle is included in the rebar.